---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroManagerIterator.Dispose
source: html/e10d5eda-b26f-d649-cfa7-b41171a5f4a4.htm
---
# Autodesk.Revit.DB.Macros.MacroManagerIterator.Dispose Method

Releases all resources used by the MacroManagerIterator

## Syntax (C#)
```csharp
public void Dispose()
```